In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'a':1,'b':20,'c':3}

In [3]:
s = pd.Series(data)

In [4]:
s

a     1
b    20
c     3
dtype: int64

In [5]:
s[1:]+s[:-1]

a     NaN
b    40.0
c     NaN
dtype: float64

In [6]:
data = {'one':[1,2,3,np.nan],'foo':['bar']*4}
df = pd.DataFrame(data)

In [7]:
df.index = ['a','b','c','d']

In [8]:
df

   foo  one
a  bar  1.0
b  bar  2.0
c  bar  3.0
d  bar  NaN

In [9]:
df.insert(1,'bar','a')

In [10]:
df

   foo bar  one
a  bar   a  1.0
b  bar   a  2.0
c  bar   a  3.0
d  bar   a  NaN

In [14]:
index = pd.date_range('1/1/2000',periods=8)

In [15]:
index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df = pd.DataFrame(np.random.rand(8,3),index=index,columns=list('ABC'))

In [18]:
df

                   A         B         C
2000-01-01  0.112253  0.396497  0.575670
2000-01-02  0.305158  0.184772  0.060102
2000-01-03  0.079128  0.213018  0.126407
2000-01-04  0.368890  0.699429  0.923634
2000-01-05  0.693165  0.258066  0.108068
2000-01-06  0.725830  0.609057  0.366389
2000-01-07  0.207640  0.213685  0.508274
2000-01-08  0.697767  0.512773  0.162552

In [19]:
df['A']

2000-01-01    0.112253
2000-01-02    0.305158
2000-01-03    0.079128
2000-01-04    0.368890
2000-01-05    0.693165
2000-01-06    0.725830
2000-01-07    0.207640
2000-01-08    0.697767
Freq: D, Name: A, dtype: float64

In [27]:
df.sub(df['A'],axis=0)

              A         B         C
2000-01-01  0.0  0.284244  0.463417
2000-01-02  0.0 -0.120386 -0.245056
2000-01-03  0.0  0.133890  0.047279
2000-01-04  0.0  0.330539  0.554744
2000-01-05  0.0 -0.435098 -0.585097
2000-01-06  0.0 -0.116774 -0.359442
2000-01-07  0.0  0.006045  0.300634
2000-01-08  0.0 -0.184994 -0.535214

In [29]:
df*5+2

                   A         B         C
2000-01-01  2.561264  3.982484  4.878350
2000-01-02  3.525791  2.923859  2.300512
2000-01-03  2.395642  3.065092  2.632037
2000-01-04  3.844451  5.497144  6.618169
2000-01-05  5.465823  3.290332  2.540338
2000-01-06  5.629152  5.045284  3.831944
2000-01-07  3.038199  3.068423  4.541368
2000-01-08  5.488833  4.563864  2.812761

In [30]:
1/df

                    A         B          C
2000-01-01   8.908463  2.522088   1.737106
2000-01-02   3.276989  5.412082  16.638245
2000-01-03  12.637682  4.694432   7.910933
2000-01-04   2.710834  1.429738   1.082680
2000-01-05   1.442659  3.874973   9.253462
2000-01-06   1.377732  1.641883   2.729341
2000-01-07   4.816034  4.679797   1.967444
2000-01-08   1.433144  1.950182   6.151867

In [32]:
df.T.index

Index(['A', 'B', 'C'], dtype='object')

In [35]:
np.exp(df)*4

                   A         B          C
2000-01-01  4.475183  5.946431   7.113287
2000-01-02  5.427358  4.811776   4.247782
2000-01-03  4.329373  4.949629   4.538977
2000-01-04  5.784515  8.050411  10.073700
2000-01-05  8.000140  5.177699   4.456493
2000-01-06  8.265786  7.354785   5.770064
2000-01-07  4.923079  4.952928   6.649675
2000-01-08  8.037041  6.679660   4.706039

In [38]:
df.dot(df.T)

,2000-01-01 00:00:00,2000-01-02 00:00:00,2000-01-03 00:00:00,2000-01-04 00:00:00,2000-01-05 00:00:00,2000-01-06 00:00:00,2000-01-07 00:00:00,2000-01-08 00:00:00
2000-01-01,0.501206,0.142115,0.166112,0.850439,0.242343,0.533885,0.400631,0.375215
2000-01-02,0.142115,0.130874,0.071104,0.297317,0.265703,0.356050,0.133394,0.317445
2000-01-03,0.166112,0.071104,0.067617,0.294935,0.123482,0.233488,0.126198,0.184991
2000-01-04,0.850439,0.297317,0.294935,1.478380,0.536016,1.032153,0.695512,0.766186
2000-01-05,0.242343,0.265703,0.123482,0.536016,0.558754,0.699892,0.254001,0.633563
2000-01-06,0.533885,0.356050,0.233488,1.032153,0.699892,1.032021,0.467083,0.878325
2000-01-07,0.400631,0.133394,0.126198,0.695512,0.254001,0.467083,0.347117,0.337077
2000-01-08,0.375215,0.317445,0.184991,0.766186,0.633563,0.878325,0.337077,0.776237

In [39]:
df.T.dot(df)

          A         B         C
A  1.785363  1.398880  0.993489
B  1.398880  1.472073  1.355303
C  0.993489  1.355303  1.634771

In [40]:
s1 = pd.Series(np.arange(5,10))

In [41]:
s1

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [42]:
s1.dot(s1)

255

In [53]:
print(df.to_string())
df

                   A         B         C
2000-01-01  0.112253  0.396497  0.575670
2000-01-02  0.305158  0.184772  0.060102
2000-01-03  0.079128  0.213018  0.126407
2000-01-04  0.368890  0.699429  0.923634
2000-01-05  0.693165  0.258066  0.108068
2000-01-06  0.725830  0.609057  0.366389
2000-01-07  0.207640  0.213685  0.508274
2000-01-08  0.697767  0.512773  0.162552

                   A         B         C
2000-01-01  0.112253  0.396497  0.575670
2000-01-02  0.305158  0.184772  0.060102
2000-01-03  0.079128  0.213018  0.126407
2000-01-04  0.368890  0.699429  0.923634
2000-01-05  0.693165  0.258066  0.108068
2000-01-06  0.725830  0.609057  0.366389
2000-01-07  0.207640  0.213685  0.508274
2000-01-08  0.697767  0.512773  0.162552